# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 柑橘小目标检测专用优化模型
# 特性: 小目标增强、多尺度融合、轻量化设计、注意力机制
# 适用场景: 柑橘果实检测、农业小目标检测、实时检测应用

# Parameters
nc: 3 # number of classes (柑橘检测: Fruit-Citrus-0GcP, Fruit_on_Ground, Fruit_on_Tree)
scales: # model compound scaling constants - 小目标检测优化缩放
  # [depth, width, max_channels] 
  n: [0.33, 0.25, 1024]  # 超轻量版: 适合边缘设备
  s: [0.33, 0.50, 1024]  # 轻量版: 平衡性能与速度
  m: [0.67, 0.75, 768]   # 标准版: 高精度检测
  l: [1.00, 1.00, 512]   # 高精度版: 最佳检测效果
  x: [1.33, 1.25, 512]   # 极致版: 研究用途

# 小目标检测优化主干网络
backbone:
  # [from, repeats, module, args]
  # 保留更多浅层特征，减少下采样损失
  - [-1, 1, Conv, [64, 3, 2]]     # 0-P1/2 - 初始特征提取
  - [-1, 1, Conv, [128, 3, 2]]    # 1-P2/4 - 保留细节信息
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2 - 增强浅层特征
  - [-1, 1, Conv, [256, 3, 2]]    # 3-P3/8 - 小目标关键层
  - [-1, 3, C3k2, [512, False, 0.25]]  # 4 - 强化P3特征提取
  - [-1, 1, Conv, [512, 3, 2]]    # 5-P4/16 - 中等目标层
  - [-1, 3, C3k2, [512, True]]    # 6 - 增强P4特征
  - [-1, 1, Conv, [1024, 3, 2]]   # 7-P5/32 - 大目标层
  - [-1, 3, C3k2, [1024, True]]   # 8 - 深层特征提取
  - [-1, 1, SPPF, [1024, 3]]      # 9 - 小核SPPF保留细节
  - [-1, 2, C2PSA, [1024]]        # 10 - 全局注意力机制

# 小目标检测优化头部网络
head:
  # === 上采样特征融合路径 ===
  # P5 -> P4 融合 (1024 -> 512)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
  - [[-1, 6], 1, Concat, [1]]     # 12 cat backbone P4
  - [-1, 3, C3k2, [512, False]]   # 13 - 增强P4融合特征
  
  # P4 -> P3 融合 (512 -> 256) - 小目标关键路径
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 4], 1, Concat, [1]]     # 15 cat backbone P3
  - [-1, 3, C3k2, [256, False]]   # 16 - 强化小目标特征 (P3/8-small)
  
  # === 下采样特征聚合路径 ===
  # P3 -> P4 聚合 (256 -> 512)
  - [-1, 1, Conv, [256, 3, 2]]    # 17
  - [[-1, 13], 1, Concat, [1]]    # 18 cat head P4
  - [-1, 3, C3k2, [512, False]]   # 19 - 增强P4检测特征 (P4/16-medium)
  
  # P4 -> P5 聚合 (512 -> 1024)
  - [-1, 1, Conv, [512, 3, 2]]    # 20
  - [[-1, 10], 1, Concat, [1]]    # 21 cat head P5
  - [-1, 3, C3k2, [1024, True]]   # 22 - 增强P5检测特征 (P5/32-large)
  
  # === 多尺度检测头 ===
  - [[16, 19, 22], 1, Detect, [nc]]  # Detect(P3, P4, P5) - 小目标优先检测

# === 小目标检测优化配置说明 ===
# 1. 主干网络优化:
#    - 增加浅层特征提取重复次数 (2->3)
#    - 使用小核SPPF (5->3) 保留更多细节
#    - 添加全局注意力机制 C2PSA
#
# 2. 头部网络优化:
#    - 增强特征融合层重复次数 (2->3)
#    - 强化P3小目标检测路径
#    - 优化多尺度特征融合
#
# 3. 小目标检测增强:
#    - P3层专门优化小目标检测
#    - 保留更多浅层细节信息
#    - 减少下采样造成的信息损失
#
# 4. 训练建议参数:
#    - imgsz: 1024 (更大输入分辨率)
#    - conf: 0.001 (更低置信度阈值)
#    - iou: 0.5 (适中IoU阈值)
#    - max_det: 1000 (更多检测数量)
#    - close_mosaic: 20 (后期关闭数据增强)
#
# 5. 数据增强建议:
#    - 启用 mixup 和 copy_paste
#    - 使用 multi_scale 训练
#    - 适当的 hsv 颜色增强
#    - 保持 rect=False 保证多尺度
