# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect
 
# Parameters
nc: 3 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 1, CSPPC, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 1, CSPPC, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 1, CSPPC, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 1, CSPPC, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, EMA, [8]] # 参数必须远小于输入通道数 # Replaced the C2PSA attention mechanism after the SPPF layer with the EMA
 
# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
  - [[-1, 6], 1, Concat, [1]] # 12 cat backbone P4
  - [-1, 1, CSPPC, [512, False]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 4], 1, Concat, [1]] # 15 cat backbone P3
  - [-1, 1, CSPPC, [256, False]] # 16 (P3/8-small)


  - [-1, 1, Conv, [256, 3, 2]]  # 17
  - [[-1, 13], 1, Concat, [1]] # 18 cat head P4
  - [-1, 1, CSPPC, [512, False]] # 19 (P4/16-medium)


  - [-1, 1, Conv, [512, 3, 2]]  # 20
  - [[-1, 10], 1, Concat, [1]] # 21 cat head P5
  - [-1, 1, CSPPC, [1024, True]] # 22 (P5/32-large)

 
  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)